Repository: common-repository/bws-google-2-step-verification
Catalog: languages/bws-google-2-step-verification-*.po
Languages: ar, de_de, es_sp, fr_fr

source: Settings
ar: الإعدادات
de_de: Einstellungen
es_sp: Ajustes
fr_fr: Réglages

source: Upgrade to Pro
ar: الترقية إلى الاصدار المدفوع
de_de: Upgrade auf die Pro-Version
es_sp: Actualizar a Pro
fr_fr: Passer à la version Pro

source: Failed Verification Attempt
ar: محاولة التحقق الفاشلة
de_de: Fehlgeschlagener Überprüfungsversuch
es_sp: Intento de verificación fallido
fr_fr: Échec de la tentative de vérification

source: Failed 2-Step verification attempt has just been registered at {site_url}.
ar: تم تسجيل محاولة تحقق فاشلة من خطوتين للتو في {site_url}.
de_de: Ein fehlgeschlagener 2-Schritt-Verifizierungsversuch wurde gerade bei {site_url} registriert.
es_sp: Se acaba de registrar un intento fallido de verificación en 2 pasos en {site_url}.
fr_fr: L'échec de la tentative de vérification en 2 étapes vient d'être enregistré sur {site_url}.

source: If it was you, just ignore this message.
ar: إذا كنت أنت، تجاهل هذه الرسالة.
de_de: Wenn Sie es waren, ignorieren Sie diese Nachricht einfach.
es_sp: Si fue usted, ignore este mensaje.
fr_fr: Si c'est vous, ignorez ce message.

source: You have received this message because failed attempt notifications are enabled for your account. You can manage your account settings on the following page
ar: لقد تلقيت هذه الرسالة بسبب تمكين إشعارات المحاولات الفاشلة لحسابك. يمكنك إدارة إعدادات حسابك على الصفحة التالية
de_de: Sie haben diese Nachricht erhalten, weil für Ihr Konto Benachrichtigungen über fehlgeschlagene Versuche aktiviert sind. Sie können Ihre Kontoeinstellungen auf der folgenden Seite verwalten
es_sp: Ha recibido este mensaje porque las notificaciones de intentos fallidos están activadas para su cuenta. Puede gestionar la configuración de su cuenta en la siguiente página
fr_fr: Vous avez reçu ce message parce que les notifications d'échec sont activées pour votre compte. Vous pouvez gérer les paramètres de votre compte sur la page suivante

source: Verification Code
ar: رمز التحقق
de_de: Bestätigungs Code
es_sp: Código de Verificación
fr_fr: Code de vérification

source: Your verification code is {new_code}.
ar: رمز التحقق الخاص بك هو {new_code}.
de_de: Ihr Verifizierungscode lautet {new_code}.
es_sp: Su código de verificación es {new_code}.
fr_fr: Votre code de vérification est {new_code}.

source: You have received this message because someone has just tried to sign in to your account at {site_url} and requested 2-Step verification code.
ar: لقد تلقيت هذه الرسالة لأن شخصًا ما حاول للتو تسجيل الدخول إلى حسابك على {site_url} وطلب رمز التحقق بخطوتين.
de_de: Sie haben diese Nachricht erhalten, weil jemand gerade versucht hat, sich bei Ihrem Konto bei {site_url} anzumelden und einen 2-Schritt-Verifizierungscode angefordert hat.
es_sp: Ha recibido este mensaje porque alguien acaba de intentar acceder a su cuenta en {site_url} y ha solicitado un código de verificación en dos pasos.
fr_fr: Vous avez reçu ce message parce que quelqu'un vient d'essayer de se connecter à votre compte à {site_url} et a demandé un code de vérification en deux étapes.

source: Verification code has been sent. Please check your email.
ar: تم إرسال رمز التحقق. يرجى التحقق من بريدك الإلكتروني.
de_de: Der Verifizierungscode wurde gesendet. Bitte überprüfen Sie Ihre E-Mail.
es_sp: Se ha enviado el código de verificación. Por favor, compruebe su correo electrónico.
fr_fr: Le code de vérification a été envoyé. Veuillez vérifier votre courrier électronique.

source: Some problems occured during email sending.
ar: حدثت بعض المشاكل أثناء إرسال البريد الإلكتروني.
de_de: Beim Versenden von E-Mails sind einige Probleme aufgetreten.
es_sp: Se han producido algunos problemas durante el envío de correos electrónicos.
fr_fr: Des problèmes sont survenus lors de l'envoi du courrier électronique.

source: Verification with email code is disabled for this user.
ar: تم تعطيل التحقق باستخدام رمز البريد الإلكتروني لهذا المستخدم.
de_de: Die Verifizierung mit E-Mail-Code ist für diesen Benutzer deaktiviert.
es_sp: La verificación con código de correo electrónico está desactivada para este usuario.
fr_fr: La vérification par code e-mail est désactivée pour cet utilisateur.

source: ERROR
ar: خطأ
de_de: FEHLER
fr_fr: ERREUR

source: 2-Step verification failed.
ar: فشلت عملية التحقق بخطوتين.
de_de: 2-Schritt-Verifizierung fehlgeschlagen.
es_sp: la verificación en 2 pasos ha fallado.
fr_fr: la vérification en 2 étapes a échoué.

source: <strong>Error</strong>: Email verification code has expired.
ar: <strong>خطأ</strong>: انتهت صلاحية رمز التحقق من البريد الإلكتروني.
de_de: <strong>Fehler</strong>: Der E-Mail-Verifizierungscode ist abgelaufen.
es_sp: <strong>Error</strong>: El código de verificación del correo electrónico ha caducado.
fr_fr: <strong>Erreur</strong>: Le code de vérification de l'email a expiré.

source: SMS not sent. Your API key is invalid
ar: لم يتم إرسال رسالة نصية قصيرة. مفتاح API الخاص بك غير صالح
de_de: SMS nicht gesendet. Ihr API-Schlüssel ist ungültig
es_sp: SMS no enviado. Su clave API no es válida
fr_fr: SMS non envoyé. Votre clé API n'est pas valide

source: The verification is successfully completed.
ar: اكتمل التحقق بنجاح.
de_de: Die Überprüfung ist erfolgreich abgeschlossen.
es_sp: La verificación se ha completado con éxito.
fr_fr: La vérification est terminée avec succès.

source: The verification code is invalid.
ar: رمز التحقق غير صالح.
de_de: Der Verifizierungs-Code ist ungültig.
es_sp: El código de verificación no es válido.
fr_fr: Le code de vérification n'est pas valide.

source: Verification code has been resent. Please check your email.
ar: تمت إعادة إرسال رمز التحقق. يرجى التحقق من بريدك الإلكتروني.
de_de: Der Verifizierungscode wurde erneut gesendet. Bitte überprüfen Sie Ihre E-Mail.
es_sp: El código de verificación ha sido reenviado. Por favor, compruebe su correo electrónico.
fr_fr: Le code de vérification a été renvoyé. Veuillez vérifier votre courriel.

source: Invalid SMS code.
ar: رمز SMS غير صالح.
de_de: Ungültiger SMS-Code.
es_sp: Código SMS no válido.
fr_fr: Code SMS non valide.

source: Protect your personal account by enabling 2-step verification option on your profile page.
ar: قم بحماية حسابك الشخصي من خلال تمكين خيار التحقق بخطوتين على صفحة ملفك الشخصي.
de_de: Schützen Sie Ihr persönliches Konto, indem Sie auf Ihrer Profilseite die Option 2-Schritt-Verifizierung aktivieren.
es_sp: Proteja su cuenta personal activando la opción de verificación en dos pasos en su página de perfil.
fr_fr: Protégez votre compte personnel en activant l'option de vérification en deux étapes sur votre page de profil.

source: Go to my profile
ar: انتقل إلى ملفي الشخصي
de_de: Zu meinem Profil
es_sp: Ir a mi perfil
fr_fr: Aller à mon profil

source: Close notice
ar: إغلاق الإشعار
de_de: Anzeige ausblenden
es_sp: Cerrar aviso
fr_fr: Fermer avis

source: You have no backup codes.
ar: ليس لديك رموز احتياطية.
de_de: Sie haben keine Backup-Codes.
es_sp: No tiene códigos de reserva.
fr_fr: Vous n'avez pas de codes de sauvegarde.

source: Backup codes for %s
ar: الرموز الاحتياطية لـ %s
de_de: Sicherungscodes für %s
es_sp: Códigos de reserva para %s
fr_fr: Codes de sauvegarde pour %s

source: Visit the following page to generate new codes
ar: قم بزيارة الصفحة التالية لإنشاء رموز جديدة
de_de: Besuchen Sie die folgende Seite, um neue Codes zu generieren
es_sp: Visite la siguiente página para generar nuevos códigos
fr_fr: Visitez la page suivante pour générer de nouveaux codes

source: Verification code has been sent. Please check your phone.
ar: تم إرسال رمز التحقق. يرجى التحقق من هاتفك.
de_de: Der Verifizierungscode wurde gesendet. Bitte überprüfen Sie Ihr Telefon.
es_sp: Se ha enviado el código de verificación. Por favor, compruebe su teléfono.
fr_fr: Le code de vérification a été envoyé. Veuillez vérifier votre téléphone.

source: Lost your password?
ar: نسيت كلمة المرور؟
de_de: Passwort vergessen?
es_sp: ¿Perdiste tu contraseña?
fr_fr: Mot de passe oublié ?

source: 2-Step Verification value
ar: 2 - قيمة التحقق من الخطوة 2
de_de: 2-stufiger Verifizierungswert
es_sp: valor de verificación en 2 pasos
fr_fr: valeur de vérification en 2 étapes

source: Insert the code if you enabled 2-Step verification for your profile
ar: أدخل الرمز إذا قمت بتمكين التحقق بخطوتين لملفك الشخصي
de_de: Geben Sie den Code ein, wenn Sie die 2-Schritt-Verifizierung für Ihr Profil aktiviert haben
es_sp: Introduzca el código si ha activado la verificación en 2 pasos para su perfil
fr_fr: Insérez le code si vous avez activé la vérification en 2 étapes pour votre profil

source: Show secret question
ar: إظهار السؤال السري
de_de: Geheime Frage anzeigen
es_sp: Mostrar pregunta secreta
fr_fr: Afficher la question secrète

source: Send me a code via email
ar: أرسل لي رمزاً عبر البريد الإلكتروني
de_de: Senden Sie mir einen Code per E-Mail
es_sp: Envíeme un código por correo electrónico
fr_fr: Envoyez-moi un code par e-mail

source: Send me a code via sms
ar: أرسل لي رمزاً عبر رسالة نصية قصيرة
de_de: Senden Sie mir einen Code per sms
es_sp: Envíeme un código por sms
fr_fr: Envoyez-moi un code par sms

source: The code has been already sent.
ar: تم إرسال الرمز بالفعل.
de_de: Der Code wurde bereits gesendet.
es_sp: El código ya ha sido enviado.
fr_fr: Le code a déjà été envoyé.

source: Resend Code
ar: إعادة إرسال الرمز
de_de: Code erneut senden
es_sp: Reenviar código
fr_fr: Renvoyer le code

source: Cancel
ar: إلغاء
es_sp: Cancelar
fr_fr: Annuler

source: 2-Step Verification
ar: التحقق بخطوتين
de_de: 2-Schritt-Verifizierung
es_sp: verificación en 2 pasos
fr_fr: Vérification en deux étapes

source: Verification
ar: التحقق
de_de: Überprüfung
es_sp: Verificación
fr_fr: Vérification

source: Enable to activate 2-Step Verification.
ar: تمكين لتفعيل التحقُّق بخطوتين.
de_de: Aktivieren Sie, um die 2-Schritt-Verifizierung zu aktivieren.
es_sp: Habilitar para activar la Verificación en 2 pasos.
fr_fr: Activer pour activer la vérification en deux étapes.

source: Verification Methods
ar: طرق التحقق
de_de: Methoden zur Verifizierung
es_sp: Métodos de verificación
fr_fr: Méthodes de vérification

source: Email
ar: البريد

source: Authenticator app
ar: تطبيق Authenticator
es_sp: Aplicación Authenticator
fr_fr: Application d'authentification

source: Backup codes
ar: الرموز الاحتياطية
de_de: Sicherungscodes
es_sp: Códigos de seguridad
fr_fr: Codes de sauvegarde

source: Secret question
ar: السؤال السري
de_de: Geheime Frage
es_sp: Pregunta secreta
fr_fr: Question secrète

source: SMS code
ar: كود SMS
es_sp: Código SMS
fr_fr: Code SMS

source: Phone number
ar: رقم الهاتف
de_de: Telefonnummer
es_sp: Número de teléfono
fr_fr: Numéro de téléphone

source: A valid phone number is required
ar: يلزم وجود رقم هاتف ساري المفعول
de_de: Lütfen geçerli bir telefon numarası girin
es_sp: Se requiere un número de teléfono válido
fr_fr: Un numéro de téléphone valide est requis

source: Failed Attempt Notifications
ar: إشعارات المحاولات الفاشلة
de_de: Benachrichtigungen über fehlgeschlagene Versuche
es_sp: Notificaciones de intento fallido
fr_fr: Notifications d'échec des tentatives

source: Enable if you want to receive email notifications about each failed verification attempt.
ar: تمكين إذا كنت ترغب في تلقي إشعارات عبر البريد الإلكتروني حول كل محاولة تحقق فاشلة.
de_de: Aktivieren Sie diese Option, wenn Sie E-Mail-Benachrichtigungen über jeden fehlgeschlagenen Verifizierungsversuch erhalten möchten.
es_sp: Actívelo si desea recibir notificaciones por correo electrónico sobre cada intento de verificación fallido.
fr_fr: Activez cette option si vous souhaitez recevoir des notifications par courrier électronique pour chaque tentative de vérification échouée.

source: Authenticator App
ar: تطبيق Authenticator
es_sp: Aplicación Authenticator
fr_fr: Application Authenticator

source: Not verified
ar: غير موثق
de_de: Nicht verifiziert
es_sp: No Verificado
fr_fr: Non vérifié

source: Verified
ar: موثق
de_de: Verifiziert
es_sp: Verificado
fr_fr: Vérifié

source: Edit
ar: تعديل
de_de: Bearbeiten
es_sp: Editar
fr_fr: Modifier

source: Done! Your Authenticator app is set.
ar: تم! تم تعيين تطبيق Authenticator الخاص بك.
de_de: Erledigt! Ihre Authenticator-App ist eingerichtet.
es_sp: Listo Su aplicación Authenticator está configurada.
fr_fr: C'est fait ! Votre application Authenticator est configurée.

source: Download and install Authenticator application on your %1$s, %2$s or %3$s device.
ar: قم بتنزيل تطبيق Authenticator وتثبيته على جهازك %1$s أو %2$s أو %3$s.
de_de: Laden Sie die Anwendung Authenticator herunter und installieren Sie sie auf Ihrem %1$s, %2$s oder %3$s Gerät.
es_sp: Descargue e instale la aplicación Authenticator en su dispositivo %1$s, %2$s o %3$s.
fr_fr: Téléchargez et installez l'application Authenticator sur votre appareil %1$s, %2$s ou %3$s.

source: Scan the following QR code using Authenticator application.
ar: امسح رمز الاستجابة السريعة التالي باستخدام تطبيق Authenticator.
de_de: Scannen Sie den folgenden QR-Code mit der Anwendung Authenticator.
es_sp: Escanee el siguiente código QR utilizando la aplicación Authenticator.
fr_fr: Scannez le code QR suivant à l'aide de l'application Authenticator.

source: Can't scan the QR code?
ar: لا يمكنك مسح رمز الاستجابة السريعة ضوئياً؟
de_de: Sie können den QR-Code nicht scannen?
es_sp: ¿No puede escanear el código QR?
fr_fr: Vous ne pouvez pas scanner le code QR ?

source: Enter the secret key below into your Authenticator application manually
ar: أدخل المفتاح السري أدناه في تطبيق Authenticator يدويًا في تطبيق Authenticator الخاص بك
de_de: Geben Sie den geheimen Schlüssel unten manuell in Ihre Authenticator-Anwendung ein
es_sp: Introduzca manualmente la clave secreta a continuación en su aplicación Authenticator
fr_fr: Saisissez manuellement la clé secrète ci-dessous dans votre application Authenticator

source: Once you have entered the secret key, enter and verify the 6-digit verification code generated by the Authenticator app
ar: بمجرد إدخال المفتاح السري، أدخل رمز التحقق المكون من 6 أرقام الذي تم إنشاؤه بواسطة تطبيق Authenticator وتحقق منه
de_de: Sobald Sie den geheimen Schlüssel eingegeben haben, geben Sie den 6-stelligen Verifizierungscode ein, der von der Authenticator-App generiert wird, und bestätigen Sie ihn
es_sp: Una vez que haya introducido la clave secreta, introduzca y verifique el código de verificación de 6 dígitos generado por la aplicación Authenticator
fr_fr: Une fois que vous avez saisi la clé secrète, saisissez et vérifiez le code de vérification à 6 chiffres généré par l'application Authenticator

source: Once you have scanned the QR code (or entered the secret key manually), enter and verify the 6-digit verification code generated by the Authenticator app
ar: بمجرد مسح رمز الاستجابة السريعة ضوئيًا (أو إدخال المفتاح السري يدويًا)، أدخل رمز التحقق المكون من 6 أرقام الذي تم إنشاؤه بواسطة تطبيق Authenticator وتحقق منه
de_de: Nachdem Sie den QR-Code gescannt (oder den geheimen Schlüssel manuell eingegeben) haben, geben Sie den 6-stelligen Verifizierungscode ein, der von der Authenticator-App generiert wird, und verifizieren ihn
es_sp: Una vez que haya escaneado el código QR (o introducido la clave secreta manualmente), introduzca y verifique el código de verificación de 6 dígitos generado por la aplicación Authenticator
fr_fr: Après avoir scanné le code QR (ou saisi la clé secrète manuellement), saisissez et vérifiez le code de vérification à 6 chiffres généré par l'application Authenticator

source: Verify
ar: التحقق
de_de: Verifizieren
es_sp: Verificar
fr_fr: Vérifier

source: Wrong code, try again.
ar: رمز خاطئ، حاول مرة أخرى.
de_de: Falscher Code, versuchen Sie es erneut.
es_sp: Código incorrecto, inténtelo de nuevo.
fr_fr: Code erroné, réessayez.

source: Backup Codes
ar: الرموز الاحتياطية
es_sp: Códigos de respaldo
fr_fr: Codes de sauvegarde

source: Codes left: %s
ar: الرموز المتبقية: %s
de_de: Codes links: %s
es_sp: Códigos que quedan: %s
fr_fr: Codes laissés : %s

source: Download as TXT
ar: التنزيل بصيغة TXT
de_de: Als TXT herunterladen
es_sp: Descargar como TXT
fr_fr: Télécharger en TXT

source: Generate New Codes
ar: إنشاء رموز جديدة
de_de: Neue Codes generieren
es_sp: Generar nuevos códigos
fr_fr: Générer de nouveaux codes

source: Each Backup code can be used only once. You should keep it somewhere safe but accessible.
ar: يمكن استخدام كل رمز احتياطي مرة واحدة فقط. يجب عليك الاحتفاظ به في مكان آمن ولكن يمكن الوصول إليه.
de_de: Jeder Backup-Code kann nur einmal verwendet werden. Sie sollten ihn an einem sicheren, aber zugänglichen Ort aufbewahren.
es_sp: Cada código de copia de seguridad sólo puede utilizarse una vez. Debe guardarlo en un lugar seguro pero accesible.
fr_fr: Chaque code de sauvegarde ne peut être utilisé qu'une seule fois. Vous devez le conserver dans un endroit sûr mais accessible.

source: Show Codes
ar: إظهار الرموز
de_de: Codes zeigen
es_sp: Mostrar códigos
fr_fr: Afficher les codes

source: Hide Codes
ar: إخفاء الرموز
de_de: Codes ausblenden
es_sp: Ocultar códigos
fr_fr: Cacher les codes

source: Secret question :
ar: السؤال السري :
de_de: Geheime Frage :
es_sp: Pregunta secreta :
fr_fr: Question secrète :

source: Edit question data
ar: تحرير بيانات السؤال
de_de: Fragedaten bearbeiten
es_sp: Editar los datos de la pregunta
fr_fr: Modifier les données de la question

source: Enter your secret question :
ar: أدخل سؤالك السري :
de_de: Geben Sie Ihre Geheimfrage ein:
es_sp: Introduzca su pregunta secreta :
fr_fr: Saisissez votre question secrète :

source: Enter answer for secret question :
ar: أدخل إجابة السؤال السري :
de_de: Geben Sie die Antwort auf die geheime Frage ein:
es_sp: Introduzca la respuesta a la pregunta secreta :
fr_fr: Saisissez la réponse à la question secrète :

source: Enable if you want the user to use 2-Step Verification.
ar: قم بالتمكين إذا كنت تريد أن يستخدم المستخدم التحقق بخطوتين.
de_de: Aktivieren Sie diese Option, wenn Sie möchten, dass der Benutzer die 2-Schritt-Verifizierung verwendet.
es_sp: Actívelo si desea que el usuario utilice la Verificación en 2 pasos.
fr_fr: Activez cette option si vous souhaitez que l'utilisateur utilise la vérification en deux étapes.

source: Sorry, your nonce did not verify.
ar: عذرا، لم يتم التأكيد.
de_de: Entschuldigung, Ihr Verifizierung ist ungültig.
es_sp: Lo siento, error de verificación.
fr_fr: Désolé, votre nonce n' a pas été vérifié.

source: You should enable and configure at least one verification method.
ar: يجب تمكين طريقة تحقق واحدة على الأقل وتكوينها.
de_de: Sie sollten mindestens eine Überprüfungsmethode aktivieren und konfigurieren.
es_sp: Debe activar y configurar al menos un método de verificación.
fr_fr: Vous devez activer et configurer au moins une méthode de vérification.

source: 2-Step Verification has been disabled.
ar: تم تعطيل التحقق بخطوتين.
de_de: die 2-Schritt-Verifizierung wurde deaktiviert.
es_sp: se ha desactivado la verificación en 2 pasos.
fr_fr: la vérification en 2 étapes a été désactivée.

source: At least one enabled verification method should be configured properly.
ar: يجب تكوين طريقة تحقق واحدة على الأقل ممكّنة بشكل صحيح.
de_de: Mindestens eine aktivierte Überprüfungsmethode sollte richtig konfiguriert sein.
es_sp: Al menos un método de verificación habilitado debe estar configurado correctamente.
fr_fr: Au moins une méthode de vérification activée doit être configurée correctement.

source: FAQ
ar: الأسئلة الشائعة

source: Support
ar: الدعم
es_sp: Soporte

source: This is your question :
ar: هذا هو سؤالك :
de_de: Dies ist Ihre Frage:
es_sp: Esta es su pregunta :
fr_fr: Voici votre question :

source: You have empty secret pass
ar: لديك تصريح مرور سري فارغ
de_de: Sie haben einen leeren Geheimpass
es_sp: Tiene el pase secreto vacío
fr_fr: Vous avez un laissez-passer secret vide

source: Notifications
ar: الإشعارات
de_de: Benachrichtigungen
es_sp: Notificaciones

source: Misc
ar: متفرقات
de_de: Verschiedenes
es_sp: Otros
fr_fr: Divers

source: Custom Code
ar: كود مخصص
de_de: Benutzerdefinierter Code
es_sp: Código personalizado
fr_fr: Code personnalisé

source: License Key
ar: مفتاح الترخيص
de_de: Lizenzschlüssel
es_sp: Clave de licencia
fr_fr: Clé de licence

source: Settings saved.
ar: تم حفظ الإعدادات.
de_de: Einstellungen gespeichert.
es_sp: Ajustes guardados.
fr_fr: Paramètres sauvegardés.

source: Please enable JavaScript in Your browser.
ar: يرجى تفعيل JavaScript في متصفحك.
de_de: Bitte aktivieren Sie JavaScript in Ihrem Browser.
es_sp: Active JavaScript en su navegador.
fr_fr: Veuillez activer JavaScript dans votre navigateur.

source: Note
ar: ملاحظة
de_de: Hinweis
es_sp: Nota

source: Users should enable 2-step verification option for their accounts on the personal profile page.
ar: يجب على المستخدمين تمكين خيار التحقق بخطوتين لحساباتهم على صفحة الملف الشخصيّ.
de_de: Benutzer sollten die 2-Schritt-Verifizierung für ihre Konten auf der persönlichen Profilseite aktivieren.
es_sp: Los usuarios deben activar la opción de verificación en dos pasos para sus cuentas en la página de perfil personal.
fr_fr: Les utilisateurs doivent activer l'option de vérification en deux étapes pour leurs comptes sur la page de leur profil personnel.

source: 2-Step Verification Settings
ar: إعدادات التحقق بخطوتين
de_de: einstellungen für die 2-Schritt-Verifizierung
es_sp: configuración de la verificación en 2 pasos
fr_fr: paramètres de la vérification en 2 étapes

source: Email Verification by Default
ar: التحقق من البريد الإلكتروني افتراضيًا
de_de: E-Mail-Überprüfung als Standard
es_sp: Verificación del correo electrónico por defecto
fr_fr: Vérification de l'email par défaut

source: Enable to apply 2-step authentication via email to the new user by default.
ar: تمكين تطبيق المصادقة بخطوتين عبر البريد الإلكتروني للمستخدم الجديد بشكل افتراضي.
de_de: Aktivieren Sie diese Option, um die 2-stufige Authentifizierung per E-Mail auf den neuen Benutzer standardmäßig anzuwenden.
es_sp: Habilitar para aplicar la autenticación en 2 pasos por correo electrónico al nuevo usuario por defecto.
fr_fr: Activez cette option pour appliquer l'authentification en deux étapes par e-mail au nouvel utilisateur par défaut.

source: Close
ar: إغلاق
de_de: Schließen
es_sp: Cerrar
fr_fr: Fermer

source: Verification Methods for Non-registered Users
ar: طرق التحقق للمستخدمين غير المسجلين
de_de: Überprüfungsmethoden für nicht registrierte Benutzer
es_sp: Métodos de verificación para usuarios no registrados
fr_fr: Méthodes de vérification pour les utilisateurs non enregistrés

source: SMS Settings
ar: إعدادات SMS
de_de: SMS Einstellungen
es_sp: Ajustes de SMS
fr_fr: Paramètres SMS

source: Register your website in
ar: سجّل موقع الويب الخاص بك في
de_de: Registrieren Sie Ihre Website in
es_sp: Registre su sitio web en
fr_fr: Enregistrez votre site web dans

source: Firebase console
ar: وحدة تحكم فايربيس
de_de: Firebase-Konsole
es_sp: Consola Firebase
fr_fr: Console Firebase

source: to use the SMS code verification method. After registration add the API key into the field below.
ar: لاستخدام طريقة التحقق من رمز الرسائل النصية القصيرة. بعد التسجيل أضف مفتاح API في الحقل أدناه.
de_de: um die Methode der SMS-Code-Überprüfung zu verwenden. Geben Sie nach der Registrierung den API-Schlüssel in das unten stehende Feld ein.
es_sp: para utilizar el método de verificación por código SMS. Tras el registro, añada la clave API en el campo inferior.
fr_fr: pour utiliser la méthode de vérification par code SMS. Après l'enregistrement, ajoutez la clé API dans le champ ci-dessous.

source: Need help to setup a Firebase account?
ar: هل تحتاج إلى مساعدة لإعداد حساب Firebase؟
de_de: Benötigen Sie Hilfe bei der Einrichtung eines Firebase-Kontos?
es_sp: ¿Necesita ayuda para configurar una cuenta Firebase?
fr_fr: Besoin d'aide pour créer un compte Firebase ?

source: Learn More
ar: تعلم المزيد
de_de: Mehr erfahren
es_sp: Aprende más
fr_fr: En savoir plus
