Repository: common-repository/bws-google-2-step-verification
Catalog: languages/bws-google-2-step-verification-*.po
Languages: ar, de_de, es_sp, fr_fr

source: API Key
ar: مفتاح API
de_de: API-Schlüssel
es_sp: Clave API
fr_fr: Clé API

source: Test Firebase SMS Auth
ar: اختبار مصادقة الرسائل النصية القصيرة من Firebase
de_de: Firebase SMS-Authentifizierung testen
es_sp: Probar Firebase SMS Auth
fr_fr: Tester Firebase SMS Auth

source: Test phone number
ar: اختبار رقم الهاتف
de_de: Test-Telefonnummer
es_sp: Número de teléfono de prueba
fr_fr: Numéro de téléphone de test

source: Send test SMS
ar: إرسال رسالة قصيرة للإختبار
de_de: Test SMS senden
es_sp: Enviar SMS de prueba
fr_fr: Envoyer le SMS Test

source: Enter the code from sms and click 'Test code' button
ar: أدخل الرمز من الرسائل القصيرة وانقر على زر "اختبار الرمز
de_de: Geben Sie den Code aus der SMS ein und klicken Sie auf die Schaltfläche 'Code testen'
es_sp: Introduzca el código del sms y pulse el botón 'Código de prueba'
fr_fr: Saisissez le code du SMS et cliquez sur le bouton "Tester le code"

source: Test code
ar: رمز الاختبار
es_sp: Código de prueba
fr_fr: Code de test

source: Enable Verification for
ar: تمكين التحقق من
de_de: Aktivieren Sie die Verifizierung für
es_sp: Activar la verificación para
fr_fr: Activer la vérification pour

source: All
ar: الكل
de_de: Alle
es_sp: Todo
fr_fr: Tout

source: Uncheck if you would like to allow 2-Step Verification only for the administrator
ar: قم بإلغاء التحديد إذا كنت ترغب في السماح بالتحقق بخطوتين فقط للمسؤول
de_de: Deaktivieren Sie das Kontrollkästchen, wenn Sie die 2-Schritt-Überprüfung nur für den Administrator zulassen möchten
es_sp: Desmarque si desea permitir la verificación en dos pasos sólo para el administrador
fr_fr: Décochez cette case si vous souhaitez autoriser la vérification en deux étapes uniquement pour l'administrateur

source: Email Codes Expiration Time
ar: وقت انتهاء صلاحية رموز البريد الإلكتروني
de_de: E-Mail-Codes Verfallszeit
es_sp: Hora de caducidad de los códigos de correo electrónico
fr_fr: Délai d'expiration des codes de courrier électronique

source: minute(-s)
ar: دقيقة (-دقائق)
es_sp: minuto(-s)

source: Set "%d" to disable expiration time.
ar: قم بتعيين "%d" لتعطيل وقت انتهاء الصلاحية.
de_de: Stellen Sie "%d" ein, um die Verfallszeit zu deaktivieren.
es_sp: Fije "%d" para desactivar el tiempo de caducidad.
fr_fr: Réglez "%d" pour désactiver le délai d'expiration.

source: Authenticator Time Window
ar: النافذة الزمنية للموثق
de_de: Authenticator Zeitfenster
es_sp: Ventana de tiempo del autenticador
fr_fr: Fenêtre temporelle de l'authentificateur

source: Time-based codes generation depends upon the time. The time on your web-server and on device with Authenticator app should be the same. You can increase Authenticator time window if you want to allow some difference between your web-server's and user device's time.
ar: يعتمد إنشاء الرموز المستندة إلى الوقت على الوقت. يجب أن يكون الوقت على خادم الويب الخاص بك وعلى الجهاز الذي يحتوي على تطبيق Authenticator هو نفسه. يمكنك زيادة نافذة وقت Authenticator إذا كنت تريد السماح ببعض الاختلاف بين وقت خادم الويب الخاص بك ووقت جهاز المستخدم.
de_de: Die Generierung zeitbasierter Codes hängt von der Uhrzeit ab. Die Zeit auf Ihrem Webserver und auf dem Gerät mit der Authenticator App sollte die gleiche sein. Sie können das Authenticator-Zeitfenster vergrößern, wenn Sie einen gewissen Unterschied zwischen der Zeit auf Ihrem Webserver und der Zeit auf dem Gerät des Benutzers zulassen möchten.
es_sp: La generación de códigos basados en la hora depende de la hora. La hora en su servidor web y en el dispositivo con la aplicación Authenticator debe ser la misma. Puede aumentar la ventana de tiempo del Authenticator si desea permitir alguna diferencia entre la hora de su servidor web y la del dispositivo del usuario.
fr_fr: La génération de codes basés sur le temps dépend de l'heure. L'heure sur votre serveur web et sur l'appareil avec l'application Authenticator doit être la même. Vous pouvez augmenter la fenêtre temporelle d'Authenticator si vous souhaitez autoriser une certaine différence entre l'heure de votre serveur web et celle de l'appareil de l'utilisateur.

source: Set "%1$d" to use default value (default is %2$d sec).
ar: قم بتعيين "%1$d" لاستخدام القيمة الافتراضية (الافتراضي هو %2$d ثانية).
de_de: Stellen Sie "%1$d" ein, um den Standardwert zu verwenden (Standard ist %2$d sec).
es_sp: Ajuste "%1$d" para utilizar el valor por defecto (por defecto es %2$d seg).
fr_fr: Réglez "%1$d" pour utiliser la valeur par défaut (la valeur par défaut est %2$d sec).

source: 2-Step Notifications Settings
ar: 2-إعدادات الإشعارات على خطوتين
de_de: einstellungen für 2-stufige Benachrichtigungen
es_sp: configuración de las notificaciones en 2 pasos
fr_fr: paramètres des notifications en 2 étapes

source: Email Notifications
ar: اشعارات البريد الالكتروني
de_de: E-Mail Benachrichtigungen
es_sp: Notificaciones por Correo electrónico
fr_fr: Notifications par email

source: Enable to activate failed verification attempts notifications option for users (users should enable appropriate option in their profiles to receive email notifications).
ar: تمكين تفعيل خيار إشعارات محاولات التحقق الفاشلة للمستخدمين (يجب على المستخدمين تمكين الخيار المناسب في ملفاتهم الشخصية لتلقي إشعارات البريد الإلكتروني).
de_de: Aktivieren Sie die Option zur Benachrichtigung von Benutzern über fehlgeschlagene Verifizierungsversuche (Benutzer sollten die entsprechende Option in ihren Profilen aktivieren, um E-Mail-Benachrichtigungen zu erhalten).
es_sp: Activar la opción de notificaciones de intentos de verificación fallidos para los usuarios (los usuarios deben activar la opción correspondiente en sus perfiles para recibir notificaciones por correo electrónico).
fr_fr: Activez l'option de notification des tentatives de vérification échouées pour les utilisateurs (les utilisateurs doivent activer l'option appropriée dans leur profil pour recevoir des notifications par courrier électronique).

source: Subject
ar: الموضوع
de_de: Betreff
es_sp: Tema
fr_fr: Sujet

source: Message
ar: الرسالة
de_de: Mitteilung
es_sp: Mensaje

source: Allowed variables
ar: المتغيرات المسموح بها
de_de: Erlaubte Variablen
es_sp: Variables permitidas
fr_fr: Variables autorisées

source: User name
ar: اسم المستخدم
de_de: Benutzername
es_sp: Nombre de usuario
fr_fr: Nom d'utilisateur

source: User email
ar: البريد الإلكتروني للمستخدم
de_de: E-Mail des Benutzers
es_sp: Correo electrónico del usuario
fr_fr: Email de l'utilisateur

source: Site name
ar: اسم الموقع
de_de: Name der Webseite
es_sp: Nombre del sitio
fr_fr: Nom du site

source: Site URL
ar: رابط الموقع
de_de: Seiten URL
es_sp: URL del sitio
fr_fr: URL du site

source: Date and time when the IP address was blocked
ar: التاريخ والوقت الذي تم فيه حظر عنوان IP
de_de: Datum und Uhrzeit, zu der die IP-Adresse gesperrt wurde
es_sp: Fecha y hora en que se bloqueó la dirección IP
fr_fr: Date et heure auxquelles l'adresse IP a été bloquée

source: Blocked IP address
ar: عنوان IP المحظور
de_de: Gesperrte IP-Adresse
es_sp: Dirección IP bloqueada
fr_fr: Adresse IP bloquée

source: Profile settings page URL
ar: عنوان URL لصفحة إعدادات الملف الشخصي
de_de: URL der Seite mit den Profileinstellungen
es_sp: URL de la página de configuración del perfil
fr_fr: URL de la page des paramètres du profil

source: Restore Default Email Notifications
ar: استعادة إشعارات البريد الإلكتروني الافتراضية
de_de: Standard E-Mail-Benachrichtigungen wiederherstellen
es_sp: Restaurar las notificaciones por correo electrónico predeterminadas
fr_fr: Rétablir les notifications par courriel par défaut

source: Restore Email Notifications
ar: استعادة تنبيهات البريد الإلكتروني
de_de: E-Mail-Benachrichtigungen wiederherstellen
es_sp: Restaurar las notificaciones por correo electrónico
fr_fr: Rétablir les notifications par courriel

source: Restore default email notifications.
ar: استعادة إشعارات البريد الإلكتروني الافتراضية.
de_de: Stellen Sie die Standard-E-Mail-Benachrichtigungen wieder her.
es_sp: Restablecer las notificaciones por correo electrónico predeterminadas.
fr_fr: Rétablir les notifications par courriel par défaut.
